In [8]:
#20. Créez un dataframe nommé « show_listed_in » ayant pour seul colonne « show_id » et « listed_in ».

In [1]:
import pandas as pd

# 1. Lire le fichier
# importation des données du fichier csv
data_Q20 = pd.read_csv("///home/virus//Mon-Depot//dossier .py//dataviz netflix//netflix_titles.csv", index_col=0 )

data_Q20 = data_Q20.reset_index()

data_Q20.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [12]:
## commentaire dans cast à supprimer

In [20]:
data_Q20.loc[5550 ,"cast"] = ''

In [21]:
data_Q20.loc[5550 ,"cast"]

''

In [22]:
show_listed_in_test = data_Q20.loc[data_Q20["listed_in"].notna()][['show_id', 'listed_in']]
show_listed_in = pd.DataFrame(columns = ['show_id', 'listed_in'])

for i in show_listed_in_test.index:
    listed_in = show_listed_in_test["listed_in"][i].split(", ")
    show_id = [show_listed_in_test["show_id"][i]] * len(listed_in)
    df = pd.DataFrame({'show_id': show_id,'listed_in': listed_in}, columns = ['show_id','listed_in'])
    show_listed_in = show_listed_in.append(df, ignore_index=True)
show_listed_in.duplicated().sum()

0

In [26]:
show_listed_in = show_listed_in.drop_duplicates(subset=["show_id","listed_in"])
show_listed_in

        show_id                 listed_in
0      81145628  Children & Family Movies
1      81145628                  Comedies
2      80117401           Stand-Up Comedy
3      70234439                  Kids' TV
4      80058654                  Kids' TV
...         ...                       ...
13665  70281022          British TV Shows
13666  70281022               TV Comedies
13667  70281022                 TV Dramas
13668  70153404         Classic & Cult TV
13669  70153404               TV Comedies

[13670 rows x 2 columns]

In [27]:
# 21. Créez un dataframe nommé « listed_in » ayant pour colonne « listed_in_id » et « listed_in ».

In [30]:
listed_in = show_listed_in.drop_duplicates("listed_in")

listed_in = listed_in.drop(columns=["show_id"])
listed_in = listed_in.reset_index()
listed_in = listed_in.drop(columns=["index"])
listed_in = listed_in.reset_index()
listed_in = listed_in.rename(columns={"index":"listed_in_id"})
listed_in = listed_in.drop_duplicates("listed_in")
listed_in = listed_in.drop_duplicates("listed_in_id")
listed_in.listed_in_id = listed_in.listed_in_id+1
listed_in

    listed_in_id                     listed_in
0              1      Children & Family Movies
1              2                      Comedies
2              3               Stand-Up Comedy
3              4                      Kids' TV
4              5                Crime TV Shows
5              6        International TV Shows
6              7     Spanish-Language TV Shows
7              8          International Movies
8              9              Sci-Fi & Fantasy
9             10                     Thrillers
10            11                    Docuseries
11            12           Science & Nature TV
12            13            Action & Adventure
13            14                        Dramas
14            15                   Cult Movies
15            16            Independent Movies
16            17               Romantic Movies
17            18                 Documentaries
18            19                 Horror Movies
19            20             Romantic TV Shows
20            21                   TV Comedies
21            22                     TV Dramas
22            23                  TV Thrillers
23            24                  TV Mysteries
24            25              British TV Shows
25            26              Music & Musicals
26            27                    Reality TV
27            28         TV Action & Adventure
28            29                Anime Features
29            30                 Teen TV Shows
30            31          Faith & Spirituality
31            32               Korean TV Shows
32            33                  Anime Series
33            34                  LGBTQ Movies
34            35                     TV Horror
35            36                        Movies
36            37  Stand-Up Comedy & Talk Shows
37            38           TV Sci-Fi & Fantasy
38            39                Classic Movies
39            40                 Sports Movies
40            41                      TV Shows
41            42             Classic & Cult TV

In [42]:
show_listed_in = show_listed_in.merge(listed_in)
show_listed_in = show_listed_in.drop(columns=["listed_in"])
show_listed_in

        show_id  listed_in_id
0      81145628             1
1      80182480             1
2      80182483             1
3      80182596             1
4      80182482             1
...         ...           ...
13665  80023876            42
13666  70142437            42
13667  70140450            42
13668  70153412            42
13669  70153404            42

[13670 rows x 2 columns]

In [34]:
# 22. Faire de même avec les colonnes director et cast en créant des dataframe qui leur sont dédier.

In [36]:
### DIRECTOR

In [48]:
data_Q20.head()

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [60]:
show_director_test = data_Q20.loc[data_Q20["director"].notna()][['show_id', 'director']]
show_director = pd.DataFrame(columns = ['show_id', 'director'])

for i in show_director_test.index:
    director = show_director_test["director"][i].split(", ")
    show_id = [show_listed_in_test["show_id"][i]] * len(director)
    df = pd.DataFrame({'show_id': show_id,'director': director}, columns = ['show_id','director'])
    show_director = show_director.append(df, ignore_index=True)
show_director.duplicated().sum()

1

In [63]:
show_director = show_director.drop_duplicates(subset=["show_id","director"])
show_director

       show_id              director
0     81145628          Richard Finn
1     81145628            Tim Maltby
2     80125979      Fernando Lebrija
3     70304989           Gabe Ibáñez
4     80164077          Rodrigo Toro
...        ...                   ...
4847  80164216         Thomas Astruc
4848  80115328  Vikramaditya Motwane
4849  80115328        Anurag Kashyap
4850  80176842            Jung-ah Im
4851  80126599             Onur Ünlü

[4851 rows x 2 columns]

In [66]:
show_director.duplicated().sum()

0

In [69]:
director_id = show_director.drop_duplicates("director")
director_id = director_id.drop(columns=["show_id"])
director_id = director_id.reset_index()
director_id = director_id.drop(columns=["index"])
director_id = director_id.reset_index()
director_id = director_id.rename(columns={"index":"director_id"})
director_id = director_id.drop_duplicates("director")
director_id = director_id.drop_duplicates("director_id")
director_id.director_id = director_id.director_id+1
director_id

      director_id          director
0               1      Richard Finn
1               2        Tim Maltby
2               3  Fernando Lebrija
3               4       Gabe Ibáñez
4               5      Rodrigo Toro
...           ...               ...
3650         3651       James Hawes
3651         3652        Jung-ah Im
3652         3653       Seung-uk Jo
3653         3654   Andy Devonshire
3654         3655         Onur Ünlü

[3655 rows x 2 columns]

In [72]:
show_director = show_director.merge(director_id)
show_director = show_director.drop(columns=["director"])
show_director = show_director.drop_duplicates(subset=["show_id","director_id"])
#show_director = show_director.drop_duplicates("director_id")
show_director

       show_id  director_id
0     81145628            1
1     81145628            2
2     81065331            2
3     80125979            3
4     70304989            4
...        ...          ...
4846  80176929         3652
4847  80176842         3652
4848  80176929         3653
4849  80063224         3654
4850  80126599         3655

[4851 rows x 2 columns]

In [75]:
###  81018067-1841

In [78]:
### CAST

In [81]:
#data_Q20.cast = data_Q20['cast'].astype(str)

In [84]:
show_cast_test = data_Q20.loc[data_Q20["cast"].notna()][['show_id', 'cast']]
show_cast = pd.DataFrame(columns = ['show_id', 'cast'])

for i in show_cast_test.index:
    cast = show_cast_test["cast"][i].split(", ")
    show_id = [show_cast_test["show_id"][i]] * len(cast)
    df = pd.DataFrame({'show_id': show_id,'cast': cast}, columns = ['show_id','cast'])
    show_cast = show_cast.append(df, ignore_index=True)
show_cast.duplicated().sum()

1

In [87]:
show_cast = show_cast.drop_duplicates(subset=["show_id","cast"])
show_cast

        show_id              cast
0      81145628     Alan Marriott
1      81145628       Andrew Toth
2      81145628      Brian Dobson
3      81145628       Cole Howard
4      81145628  Jennifer Cameron
...         ...               ...
44305  70153404     Courteney Cox
44306  70153404       Lisa Kudrow
44307  70153404      Matt LeBlanc
44308  70153404     Matthew Perry
44309  70153404   David Schwimmer

[44309 rows x 2 columns]

In [90]:
show_cast.duplicated().sum()

0

In [93]:
cast_id = show_cast.drop_duplicates("cast")
cast_id = cast_id.drop(columns=["show_id"])
cast_id = cast_id.reset_index()
cast_id = cast_id.drop(columns=["index"])
cast_id = cast_id.reset_index()
cast_id = cast_id.rename(columns={"index":"cast_id"})
cast_id = cast_id.drop_duplicates("cast")
cast_id = cast_id.drop_duplicates("cast_id")
cast_id.cast_id = cast_id.cast_id + 1
cast_id

       cast_id              cast
0            1     Alan Marriott
1            2       Andrew Toth
2            3      Brian Dobson
3            4       Cole Howard
4            5  Jennifer Cameron
...        ...               ...
27399    27400   Rosie Cavaliero
27400    27401  Vicki Pepperdine
27401    27402   Margaret Clunie
27402    27403         Tim Steed
27403    27404     Matthew Perry

[27404 rows x 2 columns]

In [96]:
show_cast = show_cast.merge(cast_id)
show_cast = show_cast.drop(columns=["cast"])
show_cast = show_cast.drop_duplicates(subset=["show_id","cast_id"])
show_cast

        show_id  cast_id
0      81145628        1
1      81065331        1
2      70109891        1
3      81145628        2
4      80191075        2
...         ...      ...
44304  70281022    27400
44305  70281022    27401
44306  70281022    27402
44307  70281022    27403
44308  70153404    27404

[44309 rows x 2 columns]

In [99]:
## COUNTRY

In [102]:
#data_Q20.country = data_Q20['country'].astype(str)

In [105]:
show_country_test = data_Q20.loc[data_Q20["country"].notna()][['show_id', 'country']]
show_country = pd.DataFrame(columns = ['show_id', 'country'])

for i in show_country_test.index:
    country = show_country_test["country"][i].split(", ")
    show_id = [show_country_test["show_id"][i]] * len(country)
    df = pd.DataFrame({'show_id': show_id,'country': country}, columns = ['show_id','country'])
    show_country = show_country.append(df, ignore_index=True)
show_country.duplicated().sum()

0

In [108]:
import re 
show_country = show_country.replace ({'country': {',': ""}}, regex = True)

show_country

       show_id         country
0     81145628   United States
1     81145628           India
2     81145628     South Korea
3     81145628           China
4     80117401  United Kingdom
...        ...             ...
7174  80005756       Australia
7175  80000063   United States
7176  70286564   United States
7177  70281022  United Kingdom
7178  70153404   United States

[7179 rows x 2 columns]

In [111]:
show_country

       show_id         country
0     81145628   United States
1     81145628           India
2     81145628     South Korea
3     81145628           China
4     80117401  United Kingdom
...        ...             ...
7174  80005756       Australia
7175  80000063   United States
7176  70286564   United States
7177  70281022  United Kingdom
7178  70153404   United States

[7179 rows x 2 columns]

In [114]:
country_id = show_country.drop_duplicates("country")
country_id = country_id.drop(columns=["show_id"])
country_id = country_id.reset_index()
country_id = country_id.drop(columns=["index"])
country_id = country_id.reset_index()
country_id = country_id.rename(columns={"index":"country_id"})
country_id = country_id.drop_duplicates("country")
country_id = country_id.drop_duplicates("country_id")
country_id.country_id = country_id.country_id + 1
country_id

     country_id         country
0             1   United States
1             2           India
2             3     South Korea
3             4           China
4             5  United Kingdom
..          ...             ...
105         106         Bermuda
106         107         Ecuador
107         108           Syria
108         109          Kuwait
109         110          Cyprus

[110 rows x 2 columns]

In [117]:
show_country = show_country.merge(country_id)
show_country = show_country.drop(columns=["country"])
show_country

       show_id  country_id
0     81145628           1
1     70234439           1
2     80058654           1
3     80125979           1
4     70304989           1
...        ...         ...
7174  70308278         106
7175  70308278         107
7176  80217848         108
7177  80217848         109
7178  80162994         110

[7179 rows x 2 columns]

In [ ]:
# Une fois fait, supprimez les colonnes listed_in, director et cast du dataframe initial

In [122]:
data_DROPING = data_Q20

In [125]:
data_DROPING = data_DROPING.drop(columns=["director"])
data_DROPING.head()

,show_id,type,title,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

In [ ]:
data_DROPING = data_DROPING.drop(columns=["cast"])
data_DROPING.head()

In [130]:
data_DROPING = data_DROPING.drop(columns=["listed_in"])
data_DROPING.head()

,show_id,type,title,country,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,United States,"September 8, 2018",2016,TV-Y7,1 Season,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,United States,"September 8, 2017",2017,TV-14,99 min,When nerdy high schooler Dani finally attracts...

In [133]:
data_DROPING = data_DROPING.drop(columns=["country"])
data_DROPING.head()

,show_id,type,title,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"September 9, 2019",2019,TV-PG,90 min,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,"September 9, 2016",2016,TV-MA,94 min,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,"September 8, 2018",2013,TV-Y7-FV,1 Season,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,"September 8, 2018",2016,TV-Y7,1 Season,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,"September 8, 2017",2017,TV-14,99 min,When nerdy high schooler Dani finally attracts...

In [136]:
# Modifier le type de duration et date_added

In [139]:
data_DROPING.dtypes

show_id                  int64
type                    object
title                   object
date_added      datetime64[ns]
release_year             int64
rating                  object
duration                object
description             object
dtype: object

In [142]:
import re 
data_DROPING = data_DROPING.replace ({'duration': {'min': "", 'Seasons': "", 'Season': ""}}, regex = True)

data_DROPING

,show_id,type,title,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,2019-09-09,2019,TV-PG,90,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,2016-09-09,2016,TV-MA,94,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,2018-09-08,2013,TV-Y7-FV,1,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,2018-09-08,2016,TV-Y7,1,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,2017-09-08,2017,TV-14,99,When nerdy high schooler Dani finally attracts...
...,...,...,...,...,...,...,...,...
6229,80000063,TV Show,Red vs. Blue,NaT,2015,NR,13,"This parody of first-person shooter games, mil..."
6230,70286564,TV Show,Maron,NaT,2016,TV-MA,4,"Marc Maron stars as Marc Maron, who interviews..."
6231,80116008,Movie,Little Baby Bum: Nursery Rhyme Friends,NaT,2016,NaN,60,Nursery rhymes and original music for children...
6232,70281022,TV Show,A Young Doctor's Notebook and Other Stories,NaT,2013,TV-MA,2,"Set during the Russian Revolution, this comic ..."
6233,70153404,TV Show,Friends,NaT,2003,TV-14,10,This hit sitcom follows the merry misadventure...

In [145]:
data_DROPING.dtypes

show_id                  int64
type                    object
title                   object
date_added      datetime64[ns]
release_year             int64
rating                  object
duration                object
description             object
dtype: object

In [148]:
data_DROPING.duration = data_DROPING.duration.astype('int')

In [151]:
data_DROPING.dtypes

show_id                  int64
type                    object
title                   object
date_added      datetime64[ns]
release_year             int64
rating                  object
duration                 int64
description             object
dtype: object

In [154]:
data_DROPING['date_added'] = data_DROPING['date_added'].apply(pd.to_datetime)
data_DROPING.head()

,show_id,type,title,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,2019-09-09,2019,TV-PG,90,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,2016-09-09,2016,TV-MA,94,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,2018-09-08,2013,TV-Y7-FV,1,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,2018-09-08,2016,TV-Y7,1,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,2017-09-08,2017,TV-14,99,When nerdy high schooler Dani finally attracts...

In [157]:
data_DROPING.dtypes

show_id                  int64
type                    object
title                   object
date_added      datetime64[ns]
release_year             int64
rating                  object
duration                 int64
description             object
dtype: object

In [160]:
CATALOGUE = data_DROPING
CATALOGUE

,show_id,type,title,date_added,release_year,rating,duration,description
0,81145628,Movie,Norm of the North: King Sized Adventure,2019-09-09,2019,TV-PG,90,Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,2016-09-09,2016,TV-MA,94,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,2018-09-08,2013,TV-Y7-FV,1,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,2018-09-08,2016,TV-Y7,1,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,2017-09-08,2017,TV-14,99,When nerdy high schooler Dani finally attracts...
...,...,...,...,...,...,...,...,...
6229,80000063,TV Show,Red vs. Blue,NaT,2015,NR,13,"This parody of first-person shooter games, mil..."
6230,70286564,TV Show,Maron,NaT,2016,TV-MA,4,"Marc Maron stars as Marc Maron, who interviews..."
6231,80116008,Movie,Little Baby Bum: Nursery Rhyme Friends,NaT,2016,NaN,60,Nursery rhymes and original music for children...
6232,70281022,TV Show,A Young Doctor's Notebook and Other Stories,NaT,2013,TV-MA,2,"Set during the Russian Revolution, this comic ..."
6233,70153404,TV Show,Friends,NaT,2003,TV-14,10,This hit sitcom follows the merry misadventure...

In [163]:
#21. Intégrez les dataframes dans la base de données structuré
# connection to mysql server with sqlalchemy

In [201]:
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:Simplon1!@localhost:3306/netflix', echo=True)
print("Welcome")
query_show = pd.read_sql_query('SHOW TABLES FROM netflix',engine)
query_show

Welcome
2020-09-17 11:24:28,464 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2020-09-17 11:24:28,465 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,467 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2020-09-17 11:24:28,468 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,470 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2020-09-17 11:24:28,471 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,472 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2020-09-17 11:24:28,472 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,476 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2020-09-17 11:24:28,476 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,477 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2020-09-17 11:24:28,478 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,479 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2020-09-17 11:24:28,480 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:28,481 INFO sqlalchemy.engine.base.Engine SHOW TABLES FROM netflix
2020-09-17 11:24:28,481 INFO sqlalchemy.engine.base.Engine {}

    Tables_in_netflix
0               ACTOR
1     ACTOR_CATALOGUE
2           CATALOGUE
3            CATEGORY
4  CATEGORY_CATALOGUE
5             COUNTRY
6   COUNTRY_CATALOGUE
7            DIRECTOR
8  DIRECTOR_CATALOGUE

In [203]:
#cast_id.to_sql('ACTOR', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:24:36,524 INFO sqlalchemy.engine.base.Engine DESCRIBE `ACTOR`
2020-09-17 11:24:36,525 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:36,529 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:24:36,655 INFO sqlalchemy.engine.base.Engine INSERT INTO `ACTOR` (cast_id, cast) VALUES (%(cast_id)s, %(cast)s)
2020-09-17 11:24:36,655 INFO sqlalchemy.engine.base.Engine ({'cast_id': 1, 'cast': 'Alan Marriott'}, {'cast_id': 2, 'cast': 'Andrew Toth'}, {'cast_id': 3, 'cast': 'Brian Dobson'}, {'cast_id': 4, 'cast': 'Cole Howard'}, {'cast_id': 5, 'cast': 'Jennifer Cameron'}, {'cast_id': 6, 'cast': 'Jonathan Holmes'}, {'cast_id': 7, 'cast': 'Lee Tockar'}, {'cast_id': 8, 'cast': 'Lisa Durupt'}  ... displaying 10 of 27404 total bound parameter sets ...  {'cast_id': 27403, 'cast': 'Tim Steed'}, {'cast_id': 27404, 'cast': 'Matthew Perry'})
2020-09-17 11:24:36,974 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:24:36,981 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:24:36,981 INFO sqlalchemy.engine.base.Engine {}
executed

In [204]:
query_select = pd.read_sql_query('SELECT * FROM ACTOR',engine)
query_select.head()

2020-09-17 11:24:44,684 INFO sqlalchemy.engine.base.Engine SELECT * FROM ACTOR
2020-09-17 11:24:44,685 INFO sqlalchemy.engine.base.Engine {}

   cast_id              cast
0        1     Alan Marriott
1        2       Andrew Toth
2        3      Brian Dobson
3        4       Cole Howard
4        5  Jennifer Cameron

In [205]:
#CATALOGUE.to_sql('CATALOGUE', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:24:48,264 INFO sqlalchemy.engine.base.Engine DESCRIBE `CATALOGUE`
2020-09-17 11:24:48,265 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:24:48,270 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:24:48,304 INFO sqlalchemy.engine.base.Engine INSERT INTO `CATALOGUE` (show_id, type, title, date_added, release_year, rating, duration, description) VALUES (%(show_id)s, %(type)s, %(title)s, %(date_added)s, %(release_year)s, %(rating)s, %(duration)s, %(description)s)
2020-09-17 11:24:48,304 INFO sqlalchemy.engine.base.Engine ({'show_id': 81145628, 'type': 'Movie', 'title': 'Norm of the North: King Sized Adventure', 'date_added': datetime.datetime(2019, 9, 9, 0, 0), 'release_year': 2019, 'rating': 'TV-PG', 'duration': 90, 'description': 'Before planning an awesome wedding for his grandfather, a polar bear king must take back a stolen artifact from an evil archaeologist first.'}, {'show_id': 80117401, 'type': 'Movie', 'title': 'Jandino: Whatever it Takes', 'date_added': datetime.datetime(2016, 9, 9, 0, 0), 'release_year': 2016, 'rating': 'TV-MA', 'duration': 94, 'description': 'Jandino Asporaat riffs on the challenges of raising kids and serenades the audience with a rousing rendition of "Sex on Fire" in his comedy show.'}, {'show_id': 70234439, 'type': 'TV Show', 'title': 'Transformers Prime', 'date_added': datetime.datetime(2018, 9, 8, 0, 0), 'release_year': 2013, 'rating': 'TV-Y7-FV', 'duration': 1, 'description': 'With the help of three human allies, the Autobots once again protect Earth from the onslaught of the Decepticons and their leader, Megatron.'}, {'show_id': 80058654, 'type': 'TV Show', 'title': 'Transformers: Robots in Disguise', 'date_added': datetime.datetime(2018, 9, 8, 0, 0), 'release_year': 2016, 'rating': 'TV-Y7', 'duration': 1, 'description': 'When a prison ship crash unleashes hundreds of Decepticons on Earth, Bumblebee leads a new Autobot force to protect humankind.'}, {'show_id': 80125979, 'type': 'Movie', 'title': '#realityhigh', 'date_added': datetime.datetime(2017, 9, 8, 0, 0), 'release_year': 2017, 'rating': 'TV-14', 'duration': 99, 'description': 'When nerdy high schooler Dani finally attracts the interest of her longtime crush, she lands in the cross hairs of his ex, a social media celebrity.'}, {'show_id': 80163890, 'type': 'TV Show', 'title': 'Apaches', 'date_added': datetime.datetime(2017, 9, 8, 0, 0), 'release_year': 2016, 'rating': 'TV-MA', 'duration': 1, 'description': 'A young journalist is forced into a life of crime to save his father and family in this series based on the novel by Miguel Sáez Carral.'}, {'show_id': 70304989, 'type': 'Movie', 'title': 'Automata', 'date_added': datetime.datetime(2017, 9, 8, 0, 0), 'release_year': 2014, 'rating': 'R', 'duration': 110, 'description': 'In a dystopian future, an insurance adjuster for a tech company investigates a robot killed for violating protocol and discovers a global conspiracy.'}, {'show_id': 80164077, 'type': 'Movie', 'title': 'Fabrizio Copano: Solo pienso en mi', 'date_added': datetime.datetime(2017, 9, 8, 0, 0), 'release_year': 2017, 'rating': 'TV-MA', 'duration': 60, 'description': 'Fabrizio Copano takes audience participation to the next level in this stand-up set while reflecting on sperm banks, family WhatsApp groups and more.'}  ... displaying 10 of 6234 total bound parameter sets ...  {'show_id': 70281022, 'type': 'TV Show', 'title': "A Young Doctor's Notebook and Other Stories", 'date_added': None, 'release_year': 2013, 'rating': 'TV-MA', 'duration': 2, 'description': "Set during the Russian Revolution, this comic miniseries is based on a doctor's memories of his early career working in an out-of-the-way village."}, {'show_id': 70153404, 'type': 'TV Show', 'title': 'Friends', 'date_added': None, 'release_year': 2003, 'rating': 'TV-14', 'duration': 10, 'description': 'This hit sitcom follows the merry misadventures of six 20-something pals as they navigate the pitfalls of work, life and love in 1990s Manhattan.'})
2020-09-17 11:24:48,568 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:24:48,575 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:24:48,576 INFO sqlalchemy.engine.base.Engine {}
executed

In [206]:
query_select = pd.read_sql_query('SELECT * FROM CATALOGUE',engine)
query_select.head()

2020-09-17 11:24:57,657 INFO sqlalchemy.engine.base.Engine SELECT * FROM CATALOGUE
2020-09-17 11:24:57,657 INFO sqlalchemy.engine.base.Engine {}

,show_id,title,type,release_year,rating,duration,description,date_added
0,247747,Amar Akbar Anthony,Movie,1977,TV-14,172,"Abandoned in a park by their father, Amar, Akb...",2019-12-31
1,269880,Bad Boys,Movie,1995,R,119,"In this fast-paced actioner, two Miami narcoti...",2019-10-01
2,281550,La Bamba,Movie,1987,PG-13,109,The plane crash that killed Buddy Holly also t...,2020-01-01
3,284890,Barsaat,Movie,1995,TV-PG,166,A naïve young man and a rich city girl fall in...,2018-04-01
4,292118,Beavis and Butt-head Do America,Movie,1996,PG-13,81,"After realizing that their boob tube is gone, ...",2019-11-20

In [207]:
#listed_in.to_sql('CATEGORY', con=engine, index = False, if_exists = "append")
print("executed")

2020-09-17 11:25:01,137 INFO sqlalchemy.engine.base.Engine DESCRIBE `CATEGORY`
2020-09-17 11:25:01,138 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:01,141 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:01,142 INFO sqlalchemy.engine.base.Engine INSERT INTO `CATEGORY` (listed_in_id, listed_in) VALUES (%(listed_in_id)s, %(listed_in)s)
2020-09-17 11:25:01,142 INFO sqlalchemy.engine.base.Engine ({'listed_in_id': 1, 'listed_in': 'Children & Family Movies'}, {'listed_in_id': 2, 'listed_in': 'Comedies'}, {'listed_in_id': 3, 'listed_in': 'Stand-Up Comedy'}, {'listed_in_id': 4, 'listed_in': "Kids' TV"}, {'listed_in_id': 5, 'listed_in': 'Crime TV Shows'}, {'listed_in_id': 6, 'listed_in': 'International TV Shows'}, {'listed_in_id': 7, 'listed_in': 'Spanish-Language TV Shows'}, {'listed_in_id': 8, 'listed_in': 'International Movies'}  ... displaying 10 of 42 total bound parameter sets ...  {'listed_in_id': 41, 'listed_in': 'TV Shows'}, {'listed_in_id': 42, 'listed_in': 'Classic & Cult TV'})
2020-09-17 11:25:01,144 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:01,150 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:01,150 INFO sqlalchemy.engine.base.Engine {}
executed

In [208]:
query_select = pd.read_sql_query('SELECT * FROM CATEGORY',engine)
query_select.head()

2020-09-17 11:25:07,489 INFO sqlalchemy.engine.base.Engine SELECT * FROM CATEGORY
2020-09-17 11:25:07,490 INFO sqlalchemy.engine.base.Engine {}

   listed_in_id                 listed_in
0             1  Children & Family Movies
1             2                  Comedies
2             3           Stand-Up Comedy
3             4                  Kids' TV
4             5            Crime TV Shows

In [209]:
#country_id.to_sql('COUNTRY', con=engine, index = False, if_exists = "append")
print("executed")

2020-09-17 11:25:10,617 INFO sqlalchemy.engine.base.Engine DESCRIBE `COUNTRY`
2020-09-17 11:25:10,618 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:10,621 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:10,623 INFO sqlalchemy.engine.base.Engine INSERT INTO `COUNTRY` (country_id, country) VALUES (%(country_id)s, %(country)s)
2020-09-17 11:25:10,623 INFO sqlalchemy.engine.base.Engine ({'country_id': 1, 'country': 'United States'}, {'country_id': 2, 'country': 'India'}, {'country_id': 3, 'country': 'South Korea'}, {'country_id': 4, 'country': 'China'}, {'country_id': 5, 'country': 'United Kingdom'}, {'country_id': 6, 'country': 'Spain'}, {'country_id': 7, 'country': 'Bulgaria'}, {'country_id': 8, 'country': 'Canada'}  ... displaying 10 of 110 total bound parameter sets ...  {'country_id': 109, 'country': 'Kuwait'}, {'country_id': 110, 'country': 'Cyprus'})
2020-09-17 11:25:10,626 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:10,629 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:10,630 INFO sqlalchemy.engine.base.Engine {}
executed

In [210]:
query_select = pd.read_sql_query('SELECT * FROM COUNTRY',engine)
query_select.head()

2020-09-17 11:25:15,660 INFO sqlalchemy.engine.base.Engine SELECT * FROM COUNTRY
2020-09-17 11:25:15,661 INFO sqlalchemy.engine.base.Engine {}

   country_id         country
0           1   United States
1           2           India
2           3     South Korea
3           4           China
4           5  United Kingdom

In [211]:
#director_id.to_sql('DIRECTOR', con=engine, index = False, if_exists = "append")
print("executed")

2020-09-17 11:25:18,663 INFO sqlalchemy.engine.base.Engine DESCRIBE `DIRECTOR`
2020-09-17 11:25:18,664 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:18,666 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:18,675 INFO sqlalchemy.engine.base.Engine INSERT INTO `DIRECTOR` (director_id, director) VALUES (%(director_id)s, %(director)s)
2020-09-17 11:25:18,676 INFO sqlalchemy.engine.base.Engine ({'director_id': 1, 'director': 'Richard Finn'}, {'director_id': 2, 'director': 'Tim Maltby'}, {'director_id': 3, 'director': 'Fernando Lebrija'}, {'director_id': 4, 'director': 'Gabe Ibáñez'}, {'director_id': 5, 'director': 'Rodrigo Toro'}, {'director_id': 6, 'director': 'Francisco Schultz'}, {'director_id': 7, 'director': 'Henrik Ruben Genz'}, {'director_id': 8, 'director': 'José Miguel Contreras'}  ... displaying 10 of 3655 total bound parameter sets ...  {'director_id': 3654, 'director': 'Andy Devonshire'}, {'director_id': 3655, 'director': 'Onur Ünlü'})
2020-09-17 11:25:18,724 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:18,728 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:18,728 INFO sqlalchemy.engine.base.Engine {}
executed

In [212]:
query_select = pd.read_sql_query('SELECT * FROM DIRECTOR',engine)
query_select.head()

2020-09-17 11:25:25,268 INFO sqlalchemy.engine.base.Engine SELECT * FROM DIRECTOR
2020-09-17 11:25:25,269 INFO sqlalchemy.engine.base.Engine {}

   director_id          director
0            1      Richard Finn
1            2        Tim Maltby
2            3  Fernando Lebrija
3            4       Gabe Ibáñez
4            5      Rodrigo Toro

In [213]:
#show_listed_in.to_sql('CATEGORY_CATALOGUE', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:25:29,640 INFO sqlalchemy.engine.base.Engine DESCRIBE `CATEGORY_CATALOGUE`
2020-09-17 11:25:29,641 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:29,644 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:29,688 INFO sqlalchemy.engine.base.Engine INSERT INTO `CATEGORY_CATALOGUE` (show_id, listed_in_id) VALUES (%(show_id)s, %(listed_in_id)s)
2020-09-17 11:25:29,689 INFO sqlalchemy.engine.base.Engine ({'show_id': 81145628, 'listed_in_id': 1}, {'show_id': 80182480, 'listed_in_id': 1}, {'show_id': 80182483, 'listed_in_id': 1}, {'show_id': 80182596, 'listed_in_id': 1}, {'show_id': 80182482, 'listed_in_id': 1}, {'show_id': 80182597, 'listed_in_id': 1}, {'show_id': 80182481, 'listed_in_id': 1}, {'show_id': 80182621, 'listed_in_id': 1}  ... displaying 10 of 13670 total bound parameter sets ...  {'show_id': 70153412, 'listed_in_id': 42}, {'show_id': 70153404, 'listed_in_id': 42})
2020-09-17 11:25:29,964 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:29,968 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:29,969 INFO sqlalchemy.engine.base.Engine {}
executed

In [214]:
query_select = pd.read_sql_query('SELECT * FROM CATEGORY_CATALOGUE',engine)
query_select.head()

2020-09-17 11:25:36,330 INFO sqlalchemy.engine.base.Engine SELECT * FROM CATEGORY_CATALOGUE
2020-09-17 11:25:36,331 INFO sqlalchemy.engine.base.Engine {}

   show_id  listed_in_id
0   296682             1
1   374651             1
2   419733             1
3   510854             1
4   516154             1

In [215]:
#show_director.to_sql('DIRECTOR_CATALOGUE', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:25:39,376 INFO sqlalchemy.engine.base.Engine DESCRIBE `DIRECTOR_CATALOGUE`
2020-09-17 11:25:39,377 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:39,379 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:39,391 INFO sqlalchemy.engine.base.Engine INSERT INTO `DIRECTOR_CATALOGUE` (show_id, director_id) VALUES (%(show_id)s, %(director_id)s)
2020-09-17 11:25:39,391 INFO sqlalchemy.engine.base.Engine ({'show_id': 81145628, 'director_id': 1}, {'show_id': 81145628, 'director_id': 2}, {'show_id': 81065331, 'director_id': 2}, {'show_id': 80125979, 'director_id': 3}, {'show_id': 70304989, 'director_id': 4}, {'show_id': 80164077, 'director_id': 5}, {'show_id': 80164077, 'director_id': 6}, {'show_id': 70304990, 'director_id': 7}  ... displaying 10 of 4851 total bound parameter sets ...  {'show_id': 80063224, 'director_id': 3654}, {'show_id': 80126599, 'director_id': 3655})
2020-09-17 11:25:39,508 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:39,511 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:39,511 INFO sqlalchemy.engine.base.Engine {}
executed

In [216]:
query_select = pd.read_sql_query('SELECT * FROM DIRECTOR_CATALOGUE',engine)
query_select.head()

2020-09-17 11:25:45,735 INFO sqlalchemy.engine.base.Engine SELECT * FROM DIRECTOR_CATALOGUE
2020-09-17 11:25:45,736 INFO sqlalchemy.engine.base.Engine {}

    show_id  director_id
0  81145628            1
1  81065331            2
2  81145628            2
3  80125979            3
4  70304989            4

In [217]:
#show_cast.to_sql('ACTOR_CATALOGUE', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:25:49,018 INFO sqlalchemy.engine.base.Engine DESCRIBE `ACTOR_CATALOGUE`
2020-09-17 11:25:49,019 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:49,025 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:49,179 INFO sqlalchemy.engine.base.Engine INSERT INTO `ACTOR_CATALOGUE` (show_id, cast_id) VALUES (%(show_id)s, %(cast_id)s)
2020-09-17 11:25:49,180 INFO sqlalchemy.engine.base.Engine ({'show_id': 81145628, 'cast_id': 1}, {'show_id': 81065331, 'cast_id': 1}, {'show_id': 70109891, 'cast_id': 1}, {'show_id': 81145628, 'cast_id': 2}, {'show_id': 80191075, 'cast_id': 2}, {'show_id': 81065331, 'cast_id': 2}, {'show_id': 81145628, 'cast_id': 3}, {'show_id': 70204970, 'cast_id': 3}  ... displaying 10 of 44309 total bound parameter sets ...  {'show_id': 70281022, 'cast_id': 27403}, {'show_id': 70153404, 'cast_id': 27404})
2020-09-17 11:25:49,925 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:49,930 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:49,930 INFO sqlalchemy.engine.base.Engine {}
executed

In [218]:
query_select = pd.read_sql_query('SELECT * FROM ACTOR_CATALOGUE',engine)
query_select.head()

2020-09-17 11:25:54,626 INFO sqlalchemy.engine.base.Engine SELECT * FROM ACTOR_CATALOGUE
2020-09-17 11:25:54,627 INFO sqlalchemy.engine.base.Engine {}

   cast_id  show_id
0     2209   247747
1     2417   247747
2     2941   247747
3     3463   247747
4     8347   247747

In [219]:
#show_country.to_sql('COUNTRY_CATALOGUE', con=engine, index = False, if_exists = 'append')
print("executed")

2020-09-17 11:25:58,164 INFO sqlalchemy.engine.base.Engine DESCRIBE `COUNTRY_CATALOGUE`
2020-09-17 11:25:58,164 INFO sqlalchemy.engine.base.Engine {}
2020-09-17 11:25:58,167 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2020-09-17 11:25:58,183 INFO sqlalchemy.engine.base.Engine INSERT INTO `COUNTRY_CATALOGUE` (show_id, country_id) VALUES (%(show_id)s, %(country_id)s)
2020-09-17 11:25:58,183 INFO sqlalchemy.engine.base.Engine ({'show_id': 81145628, 'country_id': 1}, {'show_id': 70234439, 'country_id': 1}, {'show_id': 80058654, 'country_id': 1}, {'show_id': 80125979, 'country_id': 1}, {'show_id': 70304989, 'country_id': 1}, {'show_id': 80117902, 'country_id': 1}, {'show_id': 70304990, 'country_id': 1}, {'show_id': 70299204, 'country_id': 1}  ... displaying 10 of 7179 total bound parameter sets ...  {'show_id': 80217848, 'country_id': 109}, {'show_id': 80162994, 'country_id': 110})
2020-09-17 11:25:58,350 INFO sqlalchemy.engine.base.Engine COMMIT
2020-09-17 11:25:58,353 INFO sqlalchemy.engine.base.Engine SHOW FULL TABLES FROM `netflix`
2020-09-17 11:25:58,354 INFO sqlalchemy.engine.base.Engine {}
executed

In [220]:
query_select = pd.read_sql_query('SELECT * FROM COUNTRY_CATALOGUE',engine)
query_select.head()

2020-09-17 11:26:04,230 INFO sqlalchemy.engine.base.Engine SELECT * FROM COUNTRY_CATALOGUE
2020-09-17 11:26:04,231 INFO sqlalchemy.engine.base.Engine {}

   show_id  country_id
0   269880           1
1   281550           1
2   292118           1
3   296682           1
4   347365           1